app/controllers/designer_controller.rb

INSERT INTO "designers" ("name", "tel", "image_url", "presentation", "created_at", "updated_at") VALUES('bla', 1111, 'llalala', 'sadsdsa', '2011-07-05 20:51:23', '2011-07-05 20:51:23')
---
  def create
    @designer = Designer.new(params[:designer])

    if @designer.save

SELECT * FROM "designers" WHERE ("designers"."id" = 805794608)
DELETE FROM "designers" WHERE "id" = 805794608
---
  def destroy
    @designer = Designer.find(params[:id])
    @designer.destroy